In [2]:
import numpy as np
score_array = np.array([90, 70, 80, 100])
print(np.argsort(score_array)[::-1])

[3 0 2 1]

In [3]:
import pandas as pd
titanic_df = pd.read_csv("../Ch01/titanic_train.csv")
vc = titanic_df['Pclass'].value_counts()
print(vc)

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [4]:
titanic_df['Age_0'] = 0

In [5]:
pd.set_option('display.max_colwidth', 10)
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,Braund...,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,Cuming...,female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,Heikki...,female,26.0,0,0,STON/O...,7.9250,NaN,S,0

In [6]:
titanic_df.drop('Age_0', axis = 1, inplace = True)
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund...,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,Cuming...,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikki...,female,26.0,0,0,STON/O...,7.9250,NaN,S

In [7]:
data = {'Name':['Chulmin','Eunkyung','Jinwoong','Soobeom'],
        'Year':['2011','2016','2015','2015'],
        'Gender':['Male','Female','Male','Male']}
data_df = pd.DataFrame(data, index=['one','two','three','four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [13]:
print(data_df.iloc[0:1, [0,2]])

        Name Gender
one  Chulmin   Male

In [16]:
print(data_df.loc[["one", "three"], "Name"])

one       Chulmin
three    Jinwoong
Name: Name, dtype: object

In [36]:
titanic = titanic_df.groupby(by='Pclass')\
[['PassengerId', 'Survived']].count()
titanic

        PassengerId  Survived
Pclass
1             216         216
2             184         184
3             491         491

In [38]:
pd.set_option('display.max_rows', None)
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,Braund...,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,Cuming...,female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,Heikki...,female,26.0,0,0,STON/O...,7.9250,NaN,S,0

In [39]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Age_0            0
dtype: int64

In [40]:
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())

In [41]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Age_0            0
dtype: int64

In [45]:
titanic_df['Child Adult'] = titanic_df['Age'].\
    apply(lambda x: 'Child' if x <= 15 else 'Adult')
titanic_df[['Age','Child Adult']].head(8)

         Age Child Adult
0  22.000000      Adult
1  38.000000      Adult
2  26.000000      Adult
3  35.000000      Adult
4  35.000000      Adult
5  29.699118      Adult
6  54.000000      Adult
7   2.000000      Child

In [3]:
from sklearn.datasets import load_iris
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
import pandas as pd

iris = load_iris()
iris_data = iris.data
iris_label = iris.target
iris_df = pd.DataFrame(data=iris_data, columns=iris.feature_names)
# train, test 데이터셋 7:3로 분할
X_train, X_test, y_train, y_test = train_test_split\
    (iris_data, iris_label, test_size=0.3, random_state=11)
# 객체 생성
estimator = DecisionTreeClassifier(random_state=11)
# 학습 수행
estimator.fit(X_train, y_train)
# 예측
test_predict = estimator.predict(X_test)
# 정확도 산출
print(f"예측 정확도 : {accuracy_score(y_test, test_predict):.4f}")

예측 정확도 : 0.9111